Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/older_and_retired_people/index.html.txt.tmx
Source language: en
Languages: ga

source: Older and retired people
ga: Seanóirí agus Daoine Scortha

source: Life Event Document Income supports for older people Find out about the range of payments available, and link to a broader checklist of entitlements for older people
ga: Life Event Document Fordheontais ioncaim do dhaoine aosta Faigh amach faoi raon na n-íocaíochtaí atá ar fáil, agus déan nasc le seicliosta níos leithne de theidlíochtaí do dhaoine aosta

source: The State Pension (Contributory), previously called the Old Age (Contributory) Pension, is payable to people aged 66 and over who have worked and paid enough social insurance contributions
ga: Íoctar an Pinsean Stáit (Ranníocach), a thugadh Pinsean Seanaoise (Ranníocach) roimhe sin, do dhaoine os cionn 66 bliana d'aois a d'oibrigh agus a d'íoc a ndóthain ranníocaíochtaí árachais sóisialta

source: The State Pension (Non-Contributory) previously called the Old Age Non-Contributory Pension is a means-tested payment available to people in Ireland aged 66 and over
ga: Is éard atá an Pinsean Stáit (Neamh-ranníocach), a thugadh Pinsean Seanaoise Neamh-ranníocach roimhe sin ná an íocaíocht atá ar fáil do dhaoine os cionn 66

source: Entitlements to state payments of people who retire early, whether through redundancy or by choosing early retirement and the measures they should take to ensure they retain entitlement to long-term pensions
ga: Teidlíochtaí íocaíochtaí stáit do dhaoine a dtéann amach ar pinsean luath is cuma má tá siad iomarcach nó gur roghnaigh siad féin dul amach ar pinsean luath. Deanann an doicimead seo cur síos ar ceard iad go díreach a gcuid teideal ó thaobh pinsin fadtéarmacha a choimeád

source: The Centenarian Bounty is a payment given to people resident in Ireland and certain Irish citizens living abroad when they reach the age of 100
ga: Is éard atá sa Deontas do Dhaoine in Aois a gCéid ná an íocaíocht a thugtar dóibh siúd go bhfuil cónaí orthu in Éirinn agus do shaoránaigh Éireannacha áirithe go bhfuil cónaí orthu thar lear nuair a shroicheann siad 100 bliain d'aois

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
